In [131]:
import pandas as pd
import numpy as np

pd.set_option('mode.chained_assignment', None)

In [316]:
df = pd.read_csv('ds_salary_2023.csv')
df.head()

,name,year,revenue,employee,sector,job_title,location,salary_est
0,Skillquotient,2016.0,$25 to $100 million (USD),501 to 1000 Employees,Information Technology,Artificial Intelligence- Data Science,Remote,$76K - $179K (Employer est.)
1,Sephora USA,1969.0,$1 to $5 billion (USD),10000+ Employees,Retail & Wholesale,"Manager, Data Science Analytics",Remote,$180K - $181K (Employer est.)
2,Norwin,NaN,Unknown / Non-Applicable,1 to 50 Employees,Manufacturing,Data Engineer,"South San Francisco, CA",$90.00 Per Hour(Employer est.)
3,Electric Power Research Institute,1973.0,$100 to $500 million (USD),501 to 1000 Employees,Management & Consulting,Digital Transformation/Data Science Student Employee,Remote,NaN
4,REVOLVE,2003.0,$500 million to $1 billion (USD),1001 to 5000 Employees,Retail & Wholesale,Data Science Analyst,"Cerritos, CA",$90K (Employer est.)

In [317]:
df.shape

(900, 8)

In [318]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 900 entries, 0 to 899
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        900 non-null    object
 1   year        830 non-null    float64
 2   revenue     887 non-null    object
 3   employee    887 non-null    object
 4   sector      853 non-null    object
 5   job_title   900 non-null    object
 6   location    900 non-null    object
 7   salary_est  671 non-null    object
dtypes: float64(1), object(7)
memory usage: 56.4+ KB

#### Drop nan values

In [319]:
df1 = df.dropna(axis=0)

In [320]:
df1.shape

(602, 8)

In [321]:
df1.head()

,name,year,revenue,employee,sector,job_title,location,salary_est
0,Skillquotient,2016.0,$25 to $100 million (USD),501 to 1000 Employees,Information Technology,Artificial Intelligence- Data Science,Remote,$76K - $179K (Employer est.)
1,Sephora USA,1969.0,$1 to $5 billion (USD),10000+ Employees,Retail & Wholesale,"Manager, Data Science Analytics",Remote,$180K - $181K (Employer est.)
4,REVOLVE,2003.0,$500 million to $1 billion (USD),1001 to 5000 Employees,Retail & Wholesale,Data Science Analyst,"Cerritos, CA",$90K (Employer est.)
6,Costco Wholesale,1976.0,Unknown / Non-Applicable,10000+ Employees,Retail & Wholesale,Data Engineer - Data Science & Analytics,"Seattle, WA",$100K - $135K (Employer est.)
7,Anblicks,2004.0,$5 to $25 million (USD),201 to 500 Employees,Information Technology,Data Science (AI/ML),"Dallas, TX",$57K - $90K (Glassdoor est.)

In [322]:
df1.reset_index(inplace=True)

In [323]:
df1.drop('index', axis=1, inplace=True)
df1.head()

,name,year,revenue,employee,sector,job_title,location,salary_est
0,Skillquotient,2016.0,$25 to $100 million (USD),501 to 1000 Employees,Information Technology,Artificial Intelligence- Data Science,Remote,$76K - $179K (Employer est.)
1,Sephora USA,1969.0,$1 to $5 billion (USD),10000+ Employees,Retail & Wholesale,"Manager, Data Science Analytics",Remote,$180K - $181K (Employer est.)
2,REVOLVE,2003.0,$500 million to $1 billion (USD),1001 to 5000 Employees,Retail & Wholesale,Data Science Analyst,"Cerritos, CA",$90K (Employer est.)
3,Costco Wholesale,1976.0,Unknown / Non-Applicable,10000+ Employees,Retail & Wholesale,Data Engineer - Data Science & Analytics,"Seattle, WA",$100K - $135K (Employer est.)
4,Anblicks,2004.0,$5 to $25 million (USD),201 to 500 Employees,Information Technology,Data Science (AI/ML),"Dallas, TX",$57K - $90K (Glassdoor est.)

In [324]:
df1.shape

(602, 8)

#### Add age of company

In [325]:
df1['year'] = df1['year'].astype('int')

In [326]:
df1['age'] = 2023 - df1['year']

In [327]:
df1.head()

,name,year,revenue,employee,sector,job_title,location,salary_est,age
0,Skillquotient,2016,$25 to $100 million (USD),501 to 1000 Employees,Information Technology,Artificial Intelligence- Data Science,Remote,$76K - $179K (Employer est.),7
1,Sephora USA,1969,$1 to $5 billion (USD),10000+ Employees,Retail & Wholesale,"Manager, Data Science Analytics",Remote,$180K - $181K (Employer est.),54
2,REVOLVE,2003,$500 million to $1 billion (USD),1001 to 5000 Employees,Retail & Wholesale,Data Science Analyst,"Cerritos, CA",$90K (Employer est.),20
3,Costco Wholesale,1976,Unknown / Non-Applicable,10000+ Employees,Retail & Wholesale,Data Engineer - Data Science & Analytics,"Seattle, WA",$100K - $135K (Employer est.),47
4,Anblicks,2004,$5 to $25 million (USD),201 to 500 Employees,Information Technology,Data Science (AI/ML),"Dallas, TX",$57K - $90K (Glassdoor est.),19

#### 'salary_set' column

In [328]:
pd.set_option('display.max_rows', None)
df1['salary_est'] = df1['salary_est'].apply(lambda x: x.split('(')[0])

In [329]:
df1['salary_est'] = df1['salary_est'].apply(lambda x: 0 if 'Per Hour' in x  else x.lower())

In [330]:
df1.drop(df1[df1.salary_est == 0].index, axis=0, inplace= True)

In [331]:
df1.shape

(584, 9)

In [332]:
df1['min_salary'] = df1['salary_est'].apply(lambda x: int(x.split('-')[0].replace('k', '').replace('$', '')))

In [336]:
def apply_max_salary(x):
    try: 
        x_new = x.split('-')[1].replace('k', '').replace('$', '')
        return int(x_new)
    except IndexError:
        return int(x.replace('k', '').replace('$', ''))
    
def location(x):
    try:  
        return x.split(',')[1]
    except IndexError:
        return 'Remote'

In [337]:
df1['max_salary'] = df1['salary_est'].apply(apply_max_salary)

In [338]:
df1['avg_salary'] = (df1['max_salary'] + df1['min_salary']) / 2

#### 'location' column

In [339]:
df1['location'] = df['location'].apply(location)

In [340]:
df1.head()

,name,year,revenue,employee,sector,job_title,location,salary_est,age,min_salary,max_salary,avg_salary
0,Skillquotient,2016,$25 to $100 million (USD),501 to 1000 Employees,Information Technology,Artificial Intelligence- Data Science,Remote,$76k - $179k,7,76,179,127.5
1,Sephora USA,1969,$1 to $5 billion (USD),10000+ Employees,Retail & Wholesale,"Manager, Data Science Analytics",Remote,$180k - $181k,54,180,181,180.5
2,REVOLVE,2003,$500 million to $1 billion (USD),1001 to 5000 Employees,Retail & Wholesale,Data Science Analyst,CA,$90k,20,90,90,90.0
3,Costco Wholesale,1976,Unknown / Non-Applicable,10000+ Employees,Retail & Wholesale,Data Engineer - Data Science & Analytics,Remote,$100k - $135k,47,100,135,117.5
4,Anblicks,2004,$5 to $25 million (USD),201 to 500 Employees,Information Technology,Data Science (AI/ML),CA,$57k - $90k,19,57,90,73.5

In [341]:
df1.to_csv('cleaned_data.csv')